### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import os

# File to Load 
school_data_to_load = os.path.join("Resources/schools_complete.csv")
student_data_to_load = os.path.join("Resources/students_complete.csv")

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
#check information in files, data types to do math, and if files are clean
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
#reading score,math score, and student id are int64
student_data.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [4]:
#no nulls
student_data.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [5]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
#school id, size and budget are int 64
school_data.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [7]:
#no nulls
school_data.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [8]:
#Calculate the total number of schools
ttl_schools =student_data['school_name'].nunique()
ttl_schools

15

In [9]:
#Calculate the total number of students
ttl_students = student_data['student_name'].count()
ttl_students

39170

In [10]:
#Calculate the total budget
ttl_budget= school_data['budget'].sum()
ttl_budget

24649428

In [11]:
#Calculate the average math score
#Calculate the average reading score
avg_scores =student_data.iloc[:,[5,6]].mean()
avg_scores

reading_score    81.877840
math_score       78.985371
dtype: float64

In [12]:
#check type returns
type(avg_scores)

pandas.core.series.Series

In [13]:
#check how to return each individually, reading
avg_scores['reading_score']

81.87784018381414

In [14]:
#check how to return each individually, math
avg_scores['math_score']

78.98537145774827

In [15]:
#Calculate the percentage of students with a passing math score (70 or greater)
#get as a dataframe and do math on it  
df_passing_math = student_data[(student_data['math_score'] >= 70)]

In [16]:
##Math to get passing math score
passing_math = round(df_passing_math['math_score'].count() / ttl_students *100,6)
passing_math

74.980853

In [17]:
#Calculate the percentage of students with a passing reading score (70 or greater)
#get as a dataframe and do math on it 
df_passing_read = student_data[(student_data['reading_score'] >= 70)]

In [18]:
#Calculate the percentage of students who passed math and reading (% Overall Passing)
#Dataframe of those passing, then calculate
passing_reading = round(df_passing_read['reading_score'].count() / ttl_students *100,6)
passing_reading

85.805463

In [19]:
#Math to get the 
df_overall_pass = student_data[(student_data['reading_score'] >= 70) & (student_data['math_score'] >= 70)]

In [20]:
#use student count on any row to get % passed against total students
overall_pass= round(df_overall_pass['reading_score'].count() / ttl_students *100,6)

In [21]:
overall_pass

65.172326

In [22]:
#Create a dataframe to hold the above results (showing one way to do some formatting)
#add all of the values to a dataframe
district_summary_df = pd.DataFrame([{'Total Schools': ttl_schools,
                                   'Total Students': "{:,}".format(ttl_students),
                                   'Total Budget': "${:,.2f}".format(ttl_budget),
                                   'Average Math Score': round(avg_scores['math_score'],6),
                                   'Average Reading Score':round(avg_scores['reading_score'],6),
                                   '% Passing Math': passing_math,
                                   '% Passing Reading': passing_reading,
                                   '% Overall Passing': overall_pass}])

## District School Summary:

In [23]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [24]:
#As seen below:

In [25]:
#review data looking at and see if clean
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [26]:
#check for nulls
school_data_complete.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
School ID        0
type             0
size             0
budget           0
dtype: int64

In [27]:
#check types of objects, for math calculations 
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

## Dataframe (table) for:
1. School Name
2. School Type
3. Total Students
4. Total School Budget
5. Per Student Budget
6. Average Math Score
7. Average Reading Score
8. % Passing Math
9. % Passing Reading
10. % Overall Passing (The percentage of students that passed math and reading.)

In [28]:
#Create an overview table:
#First create a dataframe which can accomodate the following aggregate functions:
#School Name, School Type, Total Students, Total School Budget, Average Math Score, Average Reading Score

#School name groupby to get School Names
data = school_data_complete.groupby(['school_name']).agg({
    #School Type
    'type': "first",
    #Total Students, usuing Student ID count
    'Student ID': "count",
    #Total Budget
    'budget': "max",
    #Average math score
    'math_score':'mean',
    #Average reading score
    'reading_score':'mean'
})

In [29]:
data.head()

                          type  Student ID   budget  math_score  reading_score
school_name
Bailey High School    District        4976  3124928   77.048432      81.033963
Cabrera High School    Charter        1858  1081356   83.061895      83.975780
Figueroa High School  District        2949  1884411   76.711767      81.158020
Ford High School      District        2739  1763916   77.102592      80.746258
Griffin High School    Charter        1468   917500   83.351499      83.816757

## This leaves: 
1. Per Student Budget
2. % Passing Math
3. % Passing Reading
4. % Overall Passing (The percentage of students that passed math and reading.)

In [30]:
#1. Per Student Budget:
#Creates a series with a matching index of school name, thus easy to insert into the dataframe
per_stu_budget= school_data.set_index('school_name')['budget']/school_data.set_index('school_name')['size']
per_stu_budget

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [31]:
type(per_stu_budget)

pandas.core.series.Series

In [32]:
data.index

Index(['Bailey High School', 'Cabrera High School', 'Figueroa High School',
       'Ford High School', 'Griffin High School', 'Hernandez High School',
       'Holden High School', 'Huang High School', 'Johnson High School',
       'Pena High School', 'Rodriguez High School', 'Shelton High School',
       'Thomas High School', 'Wilson High School', 'Wright High School'],
      dtype='object', name='school_name')

In [33]:
#same index , but not in the same order
#test inserting : True will match indexes
data.insert(3,"Per Student Budget",per_stu_budget,True)

In [34]:
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score
school_name,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963

In [35]:
#2. % Passing Math (passing math by school / total students by school *100)
# total students by school
# Need same indexes by school
students_bySchoolName= school_data_complete.groupby(['school_name'])
ttl_students_bySchool= students_bySchoolName['Student ID'].count()
ttl_students_bySchool

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: Student ID, dtype: int64

In [36]:
#2. % Passing Math
# Passing math by school
#number of students passing per school with school grouped
passing_math_bySchool = school_data_complete[school_data_complete['math_score']>=70].groupby('school_name')['Student ID'].count()
passing_math_bySchool

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: Student ID, dtype: int64

In [37]:
#2. % Passing Math: 
percent_math_pass = passing_math_bySchool / ttl_students_bySchool * 100

In [38]:
percent_math_pass.head()

school_name
Bailey High School      66.680064
Cabrera High School     94.133477
Figueroa High School    65.988471
Ford High School        68.309602
Griffin High School     93.392371
Name: Student ID, dtype: float64

In [39]:
#3. % Passing Reading  (those passing reading by school/ total students by school)
#number of students passing per school with school grouped
passing_reading_bySchool = school_data_complete[school_data_complete['reading_score']>=70].groupby('school_name')['Student ID'].count()
passing_reading_bySchool

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
Name: Student ID, dtype: int64

In [40]:
#3. % Passing Reading : (total passing reading by school/ total students by school *100)
percent_reading_pass = passing_reading_bySchool / ttl_students_bySchool * 100

In [41]:
percent_reading_pass.head()

school_name
Bailey High School      81.933280
Cabrera High School     97.039828
Figueroa High School    80.739234
Ford High School        79.299014
Griffin High School     97.138965
Name: Student ID, dtype: float64

In [42]:
#4. % Overall Passing (The percentage of students that passed math and reading.)
# Those passing overall reading and math by school / total students by school * 100
passing_bySchool = school_data_complete[(school_data_complete['reading_score']>=70) & 
                                           (school_data_complete['math_score']>=70)].groupby('school_name')['Student ID'].count()

passing_bySchool

school_name
Bailey High School       2719
Cabrera High School      1697
Figueroa High School     1569
Ford High School         1487
Griffin High School      1330
Hernandez High School    2481
Holden High School        381
Huang High School        1561
Johnson High School      2549
Pena High School          871
Rodriguez High School    2119
Shelton High School      1583
Thomas High School       1487
Wilson High School       2068
Wright High School       1626
Name: Student ID, dtype: int64

In [43]:
#4 % Overall Passing 
percent_pass = passing_bySchool / ttl_students_bySchool * 100

In [44]:
percent_pass.head(15)

school_name
Bailey High School       54.642283
Cabrera High School      91.334769
Figueroa High School     53.204476
Ford High School         54.289887
Griffin High School      90.599455
Hernandez High School    53.527508
Holden High School       89.227166
Huang High School        53.513884
Johnson High School      53.539172
Pena High School         90.540541
Rodriguez High School    52.988247
Shelton High School      89.892107
Thomas High School       90.948012
Wilson High School       90.582567
Wright High School       90.333333
Name: Student ID, dtype: float64

In [45]:
#Check the current table and add remaining columns 
data.head()

,type,Student ID,budget,Per Student Budget,math_score,reading_score
school_name,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020
Ford High School,District,2739,1763916,644.0,77.102592,80.746258
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757

In [46]:
#add the % passing Math 
# (index, title, series, True to match index)
data.insert(6,"% Passing Math",percent_math_pass,True)

In [47]:
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score,% Passing Math
school_name,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064

In [48]:
#add the % passing Reading
data.insert(7,"% Passing Reading",percent_reading_pass,True)
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score,% Passing Math,% Passing Reading
school_name,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328

In [49]:
#add the % passing overall
data.insert(8,"% Overall Passing",percent_pass,True)
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328,54.642283

In [50]:
#Tidy up the table:
#Set the table so that the index has no n
data.index.name = ''
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328,54.642283

In [51]:
data.head(1)

,type,Student ID,budget,Per Student Budget,math_score,reading_score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328,54.642283

In [52]:
#Rename some of the columns in the table:
school_summary = data.rename(columns ={"type": "School Type",
                      "Student ID": "Total Students",
                      "budget": "Total School Budget",
                      "Per Student Budget": "Per Student Budget",
                      "math_score": "Average Math Score",
                      "reading_score": "Average Reading Score",
                                  
                      })

## School Summary (not formatted):

In [53]:
school_summary

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455
Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,66.752967,80.862999,53.527508
Holden High School,Charter,427,248087,581.0,83.803279,83.814988,92.505855,96.252927,89.227166
Huang High School,District,2917,1910635,655.0,76.629414,81.182722,65.683922,81.316421,53.513884
Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,66.057551,81.222432,53.539172
Pena High School,Charter,962,585858,609.0,83.839917,84.044699,94.594595,95.945946,90.540541
Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,66.366592,80.220055,52.988247
Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,93.867121,95.854628,89.892107
Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,93.272171,97.308869,90.948012
Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,93.867718,96.539641,90.582567
Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,93.333333,96.611111,90.333333

In [54]:
# Format the table School Summary Table: (using a separate format, as well taking a copy)
f_school_summary= school_summary.copy()

## School Summary (formatted):

In [55]:
#Formatting the columns
f_school_summary.style.format({
                          "Total Students": '{:,}', 
                          "Total School Budget": "${:,.2f}", 
                          "Per Student Budget": "${:.2f}",
                          'Average Math Score': "{:.2f}", 
                          'Average Reading Score': "{:.2f}", 
                          "% Passing Math": "{:.2f}%", 
                          "% Passing Reading": "{:.2f}%", 
                          "% Overall Passing": "{:.2f}%"})

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [56]:
#Top Performing Schools by Overall Passing %:
top5_schools = school_summary.sort_values(by="% Overall Passing", ascending = False)
#Show 5 and Format the table:
top5_schools.head().style.format({"Total Students": '{:,}', 
                              "Total School Budget": "${:,.2f}", 
                              "Per Student Budget": "${:.2f}",
                              'Average Math Score': "{:.2f}", 
                              'Average Reading Score': "{:.2f}", 
                              "% Passing Math": "{:.2f}%", 
                              "% Passing Reading": "{:.2f}%", 
                              "% Overall Passing": "{:.2f}%"})

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [57]:
#Bottom Performing Schools by Overall Passing %
#again using the formatted data to display
bottom5_schools = school_summary.sort_values(by="% Overall Passing", ascending = True)
#Show 5 and Format the table:
bottom5_schools.head().style.format({"Total Students": '{:,}', 
                                  "Total School Budget": "${:,.2f}", 
                                  "Per Student Budget": "${:.2f}",
                                  'Average Math Score': "{:.2f}", 
                                  'Average Reading Score': "{:.2f}", 
                                  "% Passing Math": "{:.2f}%", 
                                  "% Passing Reading": "{:.2f}%", 
                                  "% Overall Passing": "{:.2f}%"})

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [58]:
#As seen below

In [59]:
#Using the student_data file: has school_name and grade
student_data.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79

In [60]:
#check the data types to work with
student_data.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [61]:
#Creating a copy of the original, to manipulate
dfMath_byGrade = student_data.copy()

In [62]:
#Change the grade column to be a category:
dfMath_byGrade['grade']= dfMath_byGrade ['grade'].astype("category")
dfMath_byGrade.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [63]:
#check that the grade is no longer an object:
dfMath_byGrade.dtypes

Student ID          int64
student_name       object
gender             object
grade            category
school_name        object
reading_score       int64
math_score          int64
dtype: object

In [64]:
#Create a pandas series for each grade. Hint: use a conditional statement.
dfNine= dfMath_byGrade[dfMath_byGrade['grade'] =='9th']
dfNine.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79

In [65]:
#ninth grade series by school
gdfNine=dfNine.groupby(['school_name']).mean()['math_score']
gdfNine

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [66]:
#tenth grade
dfTenth= dfMath_byGrade[dfMath_byGrade['grade'] =='10th']
dfTenth.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
8,8,Michael Roth,M,10th,Huang High School,95,87

In [67]:
#tenth grade series by school
gdfTenth=dfTenth.groupby(['school_name']).mean()['math_score']
gdfTenth

school_name
Bailey High School       76.996772
Cabrera High School      83.154506
Figueroa High School     76.539974
Ford High School         77.672316
Griffin High School      84.229064
Hernandez High School    77.337408
Holden High School       83.429825
Huang High School        75.908735
Johnson High School      76.691117
Pena High School         83.372000
Rodriguez High School    76.612500
Shelton High School      82.917411
Thomas High School       83.087886
Wilson High School       83.724422
Wright High School       84.010288
Name: math_score, dtype: float64

In [68]:
#eleventh grade
dfEleventh= dfMath_byGrade[dfMath_byGrade['grade'] =='11th']
dfEleventh.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
6,6,Sheena Carter,F,11th,Huang High School,82,80

In [69]:
#eleventh grade series by school
gdfEleventh=dfEleventh.groupby(['school_name']).mean()['math_score']
gdfEleventh

school_name
Bailey High School       77.515588
Cabrera High School      82.765560
Figueroa High School     76.884344
Ford High School         76.918058
Griffin High School      83.842105
Hernandez High School    77.136029
Holden High School       85.000000
Huang High School        76.446602
Johnson High School      77.491653
Pena High School         84.328125
Rodriguez High School    76.395626
Shelton High School      83.383495
Thomas High School       83.498795
Wilson High School       83.195326
Wright High School       83.836782
Name: math_score, dtype: float64

In [70]:
#twelth grade
dfTwelve= dfMath_byGrade[dfMath_byGrade['grade'] =='12th']
dfTwelve.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
1,1,Victor Smith,M,12th,Huang High School,94,61

In [71]:
#twelth grade series by school
gdfTwelve=dfTwelve.groupby(['school_name']).mean()['math_score']
gdfTwelve

school_name
Bailey High School       76.492218
Cabrera High School      83.277487
Figueroa High School     77.151369
Ford High School         76.179963
Griffin High School      83.356164
Hernandez High School    77.186567
Holden High School       82.855422
Huang High School        77.225641
Johnson High School      76.863248
Pena High School         84.121547
Rodriguez High School    77.690748
Shelton High School      83.778976
Thomas High School       83.497041
Wilson High School       83.035794
Wright High School       83.644986
Name: math_score, dtype: float64

In [72]:
#Combine the series into a dataframe
dfMathScoresByGrade = pd.DataFrame({"9th":gdfNine,
                                    "10th":gdfTenth,
                                    "11th":gdfEleventh,
                                    "12th":gdfTwelve
                                   })

## Math Scores By Grade (unformatted):

In [73]:
dfMathScoresByGrade

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [74]:
#Make the DataFrame Table look nice:
#Set the index to not have a name
dfMathScoresByGrade.index.name ="School Name:"

## Math Scores By Grade (formatted):

In [75]:
#Do a style format to 2 decimal places
#show and format
dfMathScoresByGrade.style.format({
                                  "9th": "{:.2f}", 
                                  "10th": "{:.2f}", 
                                  "11th": "{:.2f}", 
                                  "12th": "{:.2f}"})

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [76]:
#As seen below

In [77]:
dfRead_byGrade = student_data.copy()
#can reuse grade dfNine,dfTenth, dfEleventh, dfTwelve filters
#so need to group by reading grades

In [78]:
#ninth grade series by school
gdfNineR=dfNine.groupby(['school_name']).mean()['reading_score']
gdfNineR

school_name
Bailey High School       81.303155
Cabrera High School      83.676136
Figueroa High School     81.198598
Ford High School         80.632653
Griffin High School      83.369193
Hernandez High School    80.866860
Holden High School       83.677165
Huang High School        81.290284
Johnson High School      81.260714
Pena High School         83.807273
Rodriguez High School    80.993127
Shelton High School      84.122642
Thomas High School       83.728850
Wilson High School       83.939778
Wright High School       83.833333
Name: reading_score, dtype: float64

In [79]:
#tenth grade series by school
gdfTenthR=dfTenth.groupby(['school_name']).mean()['reading_score']
gdfTenthR

school_name
Bailey High School       80.907183
Cabrera High School      84.253219
Figueroa High School     81.408912
Ford High School         81.262712
Griffin High School      83.706897
Hernandez High School    80.660147
Holden High School       83.324561
Huang High School        81.512386
Johnson High School      80.773431
Pena High School         83.612000
Rodriguez High School    80.629808
Shelton High School      83.441964
Thomas High School       84.254157
Wilson High School       84.021452
Wright High School       83.812757
Name: reading_score, dtype: float64

In [80]:
#eleventh grade series by school
gdfEleventhR=dfEleventh.groupby(['school_name']).mean()['reading_score']
gdfEleventhR

school_name
Bailey High School       80.945643
Cabrera High School      83.788382
Figueroa High School     80.640339
Ford High School         80.403642
Griffin High School      84.288089
Hernandez High School    81.396140
Holden High School       83.815534
Huang High School        81.417476
Johnson High School      80.616027
Pena High School         84.335938
Rodriguez High School    80.864811
Shelton High School      84.373786
Thomas High School       83.585542
Wilson High School       83.764608
Wright High School       84.156322
Name: reading_score, dtype: float64

In [81]:
#twelth grade series by school
gdfTwelveR=dfTwelve.groupby(['school_name']).mean()['reading_score']
gdfTwelveR

school_name
Bailey High School       80.912451
Cabrera High School      84.287958
Figueroa High School     81.384863
Ford High School         80.662338
Griffin High School      84.013699
Hernandez High School    80.857143
Holden High School       84.698795
Huang High School        80.305983
Johnson High School      81.227564
Pena High School         84.591160
Rodriguez High School    80.376426
Shelton High School      82.781671
Thomas High School       83.831361
Wilson High School       84.317673
Wright High School       84.073171
Name: reading_score, dtype: float64

## Reading Scores By Grade (unformatted):

In [82]:
#Combine the series into a dataframe
dfReadingScoresByGrade = pd.DataFrame({"9th":gdfNineR,
                                    "10th":gdfTenthR,
                                    "11th":gdfEleventhR,
                                    "12th":gdfTwelveR
                                   })
dfReadingScoresByGrade

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [83]:
#Make the DataFrame Table look nice:
#Set the index to not have a name
dfReadingScoresByGrade.index.name ="School Name:"

## Reading Scores By Grade (formatted):

In [84]:
#Do a style format to 2 decimal places
#show and format
dfReadingScoresByGrade.style.format({
                                  "9th": "{:.2f}", 
                                  "10th": "{:.2f}", 
                                  "11th": "{:.2f}", 
                                  "12th": "{:.2f}"})

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [85]:
# As seen below:

In [86]:
#Look at what have in school summary
school_summary.head(1)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328,54.642283

In [87]:
#Create a DataFrame with the Columns need 
dfScoresBySchoolSpending = school_summary.copy()
del dfScoresBySchoolSpending['School Type']
del dfScoresBySchoolSpending['Total Students'] 
del dfScoresBySchoolSpending['Total School Budget']
#remove School Name index with default index
dfScoresBySchoolSpending.reset_index(inplace = True, drop = True)
dfScoresBySchoolSpending.head(1)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,628.0,77.048432,81.033963,66.680064,81.93328,54.642283

In [88]:
#Create bins for the categories we have:
lbls =['<$585','$585-630', '$630-645','$645-680']
bins = [0,584.999,629.999,644.999,680]
#TODO: adjust labels more accurately:
#lbls =['<$585','$585-629.99', '$630-644.99','$645-680']

In [89]:
#Divide into categories, as they are overlapping???? ASK????
#Changed my labels???
#Budget per student 
dfScoresBySchoolSpending['Spending Ranges (Per Student)'] = pd.cut(dfScoresBySchoolSpending['Per Student Budget'], bins, labels = lbls)
#school_summary

In [90]:
dfScoresBySchoolSpending.head(1)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Ranges (Per Student)
0,628.0,77.048432,81.033963,66.680064,81.93328,54.642283,$585-630

In [91]:
#?? are you taking means of all that are together?
#Before grouping delete the Per Student Budget Column
del dfScoresBySchoolSpending['Per Student Budget']
dfgScoresBySpending = dfScoresBySchoolSpending.groupby('Spending Ranges (Per Student)').mean()

## Scores by Spending (unformatted):

In [92]:
dfgScoresBySpending

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges (Per Student),,,,,
<$585,83.455399,83.933814,93.460096,96.610877,90.369459
$585-630,81.899826,83.155286,87.133538,92.718205,81.418596
$630-645,78.518855,81.624473,73.484209,84.391793,62.857656
$645-680,76.997210,81.027843,66.164813,81.133951,53.526855

## Scores by Spending (formatted):

In [93]:
#Format the columns
dfgScoresBySpending.style.format({
                                  'Average Math Score': "{:.2f}", 
                                  'Average Reading Score': "{:.2f}", 
                                  "% Passing Math": "{:.2f}%", 
                                  "% Passing Reading": "{:.2f}%", 
                                  "% Overall Passing": "{:.2f}%"})

## Scores by School Size

* Perform the same operations as above, based on school size.

In [94]:
#Create bins for the categories we have:
lbls =['Small (<1000)','Medium (1000-2000)', 'Large (2000-5000)']
bins = [0,999,1999,5000]
#TODO: adjust labels more accurately:
#lbls =['Small (<1000)','Medium (1000-1999)', 'Large (2000-5000)']

In [95]:
#use the dataframe created, but add the school size into it as a series.
dfScoresBySchoolSize = school_summary.copy()
dfScoresBySchoolSize.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [96]:
#review the school data with
school_data.head(1)

   School ID        school_name      type  size   budget
0          0  Huang High School  District  2917  1910635

In [97]:
#get a series by grouping by school_name and getting just the size
#Creates a series with a matching index of school name, thus easy to insert into the dataframe
school_data_size = school_data.set_index('school_name')['size']
school_data_size

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [98]:
#insert this into the dataset above:
dfScoresBySchoolSize.insert(0,'size',school_data_size,True)
dfScoresBySchoolSize.head()

,size,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,,
Bailey High School,4976,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,1858,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,2949,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,2739,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,1468,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [99]:
#Now can add the binning column:
dfScoresBySchoolSize['School Size']= pd.cut(dfScoresBySchoolSize['size'],bins,labels=lbls)

In [100]:
#ensure is there
dfScoresBySchoolSize.head(1)

,size,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,School Size
,,,,,,,,,,,
Bailey High School,4976,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.93328,54.642283,Large (2000-5000)

In [101]:
#remove all the columns we don't need:
del dfScoresBySchoolSize['School Type']
del dfScoresBySchoolSize['Total Students'] 
del dfScoresBySchoolSize['Total School Budget']
del dfScoresBySchoolSize['Per Student Budget']
del dfScoresBySchoolSize['size']
#remove School Name index with default index
dfScoresBySchoolSize.reset_index(inplace = True, drop = True)
dfScoresBySchoolSize.head(1)

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,School Size
0,77.048432,81.033963,66.680064,81.93328,54.642283,Large (2000-5000)

In [102]:
#Group by the newly created School Size category
dfgScoresBySchoolSize = dfScoresBySchoolSize.groupby('School Size').mean()

## Scores By School Size (unformatted):

In [103]:
dfgScoresBySchoolSize

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,89.883853
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,90.621535
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

## Scores By School Size (formatted):

In [104]:
#Format the columns:
dfgScoresBySchoolSize.style.format({
                                  'Average Math Score': "{:.2f}", 
                                  'Average Reading Score': "{:.2f}", 
                                  "% Passing Math": "{:.2f}%", 
                                  "% Passing Reading": "{:.2f}%", 
                                  "% Overall Passing": "{:.2f}%"})

## Scores by School Type

* Perform the same operations as above, based on school type

In [105]:
#As seen below:

In [106]:
#use the dataframe created
dfScoresBySchoolType = school_summary.copy()
dfScoresBySchoolType.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
,,,,,,,,,
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [107]:
#remove all the columns we don't need:
del dfScoresBySchoolType['Total Students'] 
del dfScoresBySchoolType['Total School Budget']
del dfScoresBySchoolType['Per Student Budget']
#remove School Name index with default index
dfScoresBySchoolType.reset_index(inplace = True, drop = True)
dfScoresBySchoolType.head(1)

,School Type,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,District,77.048432,81.033963,66.680064,81.93328,54.642283

## Scores By School Type (unformatted):

In [108]:
#group by the School Type: get the average for aggregation
dfgScoresBySchoolType = dfScoresBySchoolType.groupby('School Type').mean()
dfgScoresBySchoolType

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208

## Scores By School Type (formatted):

In [109]:
#Format the table:
#Format the columns:
dfgScoresBySchoolType.style.format({
                                  'Average Math Score': "{:.2f}", 
                                  'Average Reading Score': "{:.2f}", 
                                  "% Passing Math": "{:.2f}%", 
                                  "% Passing Reading": "{:.2f}%", 
                                  "% Overall Passing": "{:.2f}%"})